benchmarks/fileio_benchmark.txt
WARNING: --num-threads is deprecated, use --threads instead
sysbench 1.0.18 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      3258.76
    writes/s:                     2172.51
    fsyncs/s:                     7145.55

Throughput:
    read, MiB/s:                  50.92
    written, MiB/s:               33.95

General statistics:
    total time:                          10.0289s
    total number of events:              124154

Latency (ms):
         min:                                    0.00
         avg:                                    1.29
         max:                                   74.30
         95th percentile:                        2.43
         sum:                               159649.22

Threads fairness:
    events (avg/stddev):           7759.6250/54.88
    execution time (avg/stddev):   9.9781/0.00